
## Plan Result (terraform)

[CI link](https://github.com/naari3/bakatare-minna/actions/runs/7357138340)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_compute_instance_group_manager.minecraft_group


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_compute_instance_group_manager.minecraft_group will be created
  + resource "google_compute_instance_group_manager" "minecraft_group" {
      + base_instance_name             = "minecraft"
      + fingerprint                    = (known after apply)
      + id                             = (known after apply)
      + instance_group                 = (known after apply)
      + list_managed_instances_results = "PAGELESS"
      + name                           = "minecraft-group"
      + operation                      = (known after apply)
      + project                        = "bakatare-minecraft"
      + self_link                      = (known after apply)
      + status                         = (known after apply)
      + target_size                    = 1
      + wait_for_instances             = false
      + wait_for_instances_status      = "STABLE"
      + zone                           = "us-central1-a"

      + version {
          + instance_template = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/global/instanceTemplates/minecraft-template-20231229133628741600000001"
          + name              = "minecraft-v1"
        }
      + version {
          + instance_template = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/global/instanceTemplates/minecraft-template-20231229133628741600000001"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":45,"Program":"tfcmt","SHA1":"8ca310fc4ebaabde52f7d8880a0ebb9f67a907af","Target":"terraform","Vars":{},"WorkflowName":"test"} -->